
# 0. 텐서플로 2.0 시작하기
# 0.1 초보자용
# 0.2 전문가용

# I. 초보자용
# 1. Keras를 사용한 기본적인 머신러닝 
# 1.1 첫 번째 신경망 훈련하기: 기초적인 분류 문제
# 1.2 영화 리뷰를 사용한 텍스트 분류
# 1.3 케라스와 텐서플로 허브를 사용한 영화 리뷰 텍스트 분류하기
# 1.4 자동차 연비 예측하기: 회귀
# 1.5 과대적합과 과소적합
# 1.6 모델 저장과 복원
# 1.7 Keras Tuner 소개

# 2. 다양한 데이터 형식을 로드하고 입력 파이프라인을 빌드
# 2.1 CSV 데이터로드
# 2.2 NumPy 데이터로드
# 2.3 pandas.DataFrame로드
# 2.4 이미지로드
# 2.5 텍스트로드
# 2.6 유니코드 문자열
# 2.7 TF. 텍스트
# 2.8 TFRecord 및 tf.train.Example
# 2.9 TensorFlow I/O

# 3. 에스티 메이터
# 3.1 미리 만들어진 에스티 메이터
# 3.2 추정기(Estimator)로 선형 모델 만들기
# 3.3 에스티 메이터를 사용한 부스트 트리
# 3.4 Gradient Boosted Trees : 모델 이해
# 3.5 케라스 모델로 추정기 생성하기

# II. 전문가용
# 4. 맞춤 레이어 및 학습 루프를 빌드
# 4.1 텐서와 연산
# 4.2 사용자 정의 층
# 4.3 사용자 정의 학습: 자세히 둘러보기

# 5. 분산 훈련
# 5.1 케라스를 사용한 분산 훈련
# 5.2 훈련 루프와 함께 tf.distribute.Strategy 사용하기
# 5.3 케라스를 사용한 다중 워커(Multi-worker) 훈련
# 5.4 추정기(Estimator)를 사용한 다중 워커(Multi-worker) 훈련
# 5.5 분산 전략을 사용한 모델 저장 및 불러오기
# 5.1 분산 입력

# 6. 이미지 
# 6.1 합성곱 신경망
# 6.2 이미지 분류
# 6.3 텐서플로 허브와 전이학습
# 6.4 사전 학습된 ConvNet을 이용한 전이 학습
# 6.5 Data augmentation
# 6.6 이미지 분할
# 6.7 

# 7. 텍스트
# 7.1 단어 임베딩
# 7.2 RNN을 사용한 텍스트 분류
# 7.3 순환 신경망을 활용한 문자열 생성
# 7.4 Neural machine translation with attention
# 7.5 시각적주의가있는 이미지 캡션
# 7.6 언어 이해를위한 변환기 모델
# 7.7 BERT 모델 미세 조정

# 8. 
# 8.1 정형 데이터 다루기
# 8.2 불균형 데이터 분류
# 8.3 시계열 예측

# 9. 
# 9.1 tf.keras를 사용한 Neural Style Transfer
# 9.2 딥드림 (DeepDream)
# 9.3 ...

# 10. 
# 10.1 통합 그라디언트

# III. with keras

# IV. 기본 사용법

# V. 
